'''
Q. 클래스, 객체, 인스턴스에 대해 설명해봅시다.

A. 클래스란 전체적인 특징을 갖고 있어, 동일한 형태의 데이터를 만들 수 있는 틀이다.
이를 통해 만들어진 것이 객체이며, 각 객체는 독립적이다.
클래스를 통해 만들어진 객체를 해당 클래스의 인스턴스라고 한다.

-------------------------------------------------------------------------------

참고 자료. 점프 투 파이썬
[객체와 인스턴스의 차이]

클래스로 만든 객체를 인스턴스라고도 한다. 그렇다면 객체와 인스턴스의 차이는 무엇일까? 
이렇게 생각해 보자. a = Cookie() 이렇게 만든 a는 객체이다. 그리고 a 객체는 Cookie의 인스턴스이다. 
즉 인스턴스라는 말은 특정 객체(a)가 어떤 클래스(Cookie)의 객체인지를 관계 위주로 설명할 때 사용한다. 
"a는 인스턴스"보다는 "a는 객체"라는 표현이 어울리며 "a는 Cookie의 객체"보다는 "a는 Cookie의 인스턴스"라는 표현이 훨씬 잘 어울린다.

'''
